package org.example.homework2.hw4;

/**
 * 4)(*) Отвалидировать доску судоку
 * /Требования
 * Объявлена доска 9 x 9 необходимо отвалидировать в соответствии с правилами
 * 1. Каждая строка должна содержать цифру 1-9 без повторения
 * 2. Каждая колонка должна содержать цифру 1-9 без повторения
 * 3. Каждый под блок из 9 элементов 3 x 3 должна содержать цифру 1-9 без повторения
 * Ограничения
 * • board.length == 9
 * • board[i].length == 9
 * • board[i][j] значение число или '.'
 */
public class Ex4 {
}
